import {
  StarIcon,
  ArrowPathIcon,
  FingerPrintIcon,
} from "@heroicons/react/24/solid";

export const featuresData = [
  {
    color: "blue",
    title: "مزایای دیزاین پترن ها",
    icon: StarIcon,
    description:
      "سازماندهی و ساختاردهی کد، افزایش قابلیت خوانایی و قابلیت تغییرپذیری، استفاده مجدد از کد، کاهش تکرار و خطاها، افزایش کارایی توسعه دهندگان، افزایش سرعت توسعه و امکان توسعه پذیری برنامه",
  },
  {
    color: "red",
    title: "دیزاین پترن چیست ؟ ",
    icon: ArrowPathIcon,
    description:
      "دیزاین پترن (Design Pattern) در برنامه‌نویسی، مجموعه‌ای از روش‌ها، قواعد و الگوها است که برای حل مشکلات معمول در طراحی نرم‌افزارها استفاده می‌شود. این الگوها تجربیات و دانش‌های جمعی برنامه‌نویسان حرفه‌ای را در خصوص راهکارهای مؤثر و قابل استفاده برای مشکلات خاصی که در فرایند توسعه نرم‌افزارها ممکن است بروز کنند، جمع‌آوری می‌کنند.",
  },
  {
    color: "teal",
    title: "دسته بندی دیزاین پترن ها",
    icon: FingerPrintIcon,
    description:
      "دیزاین پترن‌ها را می‌توان به چند دسته‌ی اصلی تقسیم کرد: معماری (مانند MVC)، ساختاری (مانند Singleton)، رفتاری (مانند Observer) و آفرینشی (مانند Strategy). هر کدام را می‌توان برای حل مشکلات مربوطه و جداسازی وظایف استفاده کرد.",
  },
];

export default featuresData;
